testing/artillery/test-edit.yml
config:
  target: "http://localhost:8001"
  phases:
    - duration: 10
      arrivalRate: 10
      rampTo: 100
      name: Warm up phase
    - duration: 20
      arrivalRate: 100
      rampTo: 500
      name: Ramp up
    - duration: 30
      arrivalRate: 500
      name: Steady phase
  defaults:
    headers:
      Content-Type: "application/json"


scenarios:
  - flow:
      - post:
          url: '/editUser'
          json:
            user:
              userId: 'test1'  # Cambia el ID del usuario a uno válido
            currentPassword: '123456Aa'  # Contraseña actual del usuario
            newPassword: '123456Bb'  # Nueva contraseña