testing/artillery/test-game-new-getQuestion.yml
config:
  target: "http://localhost:8000"
  phases:
    - duration: 10
      arrivalRate: 10
      rampTo: 100
      name: Warm up phase
    - duration: 20
      arrivalRate: 100
      rampTo: 500
      name: Ramp up
    - duration: 30
      arrivalRate: 500
      name: Steady phase
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Cargar /api/game/new"
    flow:
      - post:
          url: "/api/game/new"
          json:
            gameId: "game123"
            playerId: "playerXYZ"
            language: "es"
            cacheId: "cache-test-001"

  - name: "Cargar /api/game/history/gameQuestions"
    flow:
      - post:
          url: "/api/game/history/gameQuestions"
          json:
            gameId: "game123"
            playerId: "playerXYZ"