testing/artillery/test-question-new.yml
config:
  target: "http://localhost:8000"
  phases:
  - duration: 5
    arrivalRate: 1
    rampTo: 10
    name: Warm up phase
  - duration: 5
    arrivalRate: 10
    rampTo: 20
    name: Ramp up
  - duration: 5
    arrivalRate: 20
    rampTo: 30
    name: Steady phase
scenarios:
  - name: "Test /api/question/new"
    flow:
      - post:
          url: "/api/question/new"
          json:
            gameId: "game123"
            playerId: "playerXYZ"
            language: "es"
            cacheId: "cache-test-001"