testing/artillery/test-question-new.yml
config:
  target: "http://localhost:8000"
  phases:
  - duration: 10
    arrivalRate: 10
    rampTo: 100
    name: Warm up phase
  - duration: 20
    arrivalRate: 100
    rampTo: 500
    name: Ramp up
  - duration: 30
    arrivalRate: 500
    name: Steady phase
scenarios:
  - name: "Test /api/question/new"
    flow:
      - post:
          url: "/api/question/new"
          json:
            gameId: "game123"
            playerId: "playerXYZ"
            language: "es"
            cacheId: "cache-test-001"